app/views/events/show.html.slim

    h4 Questions
    - if @event.questions.size == 0
---
SELECT "questions".* FROM "questions" WHERE "questions"."event_id" = $1  [["event_id", 5]]
SELECT COUNT(*) FROM "questions" WHERE "questions"."event_id" = $1  [["event_id", 5]]