app/controllers/answers_controller.rb

SELECT  "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT 1  [["id", 1]]
---
    def show
        @answer = Answer.find(params['id'])

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "answers" ("is_yes", "question_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["is_yes", "t"], ["question_id", 1], ["user_id", 1], ["created_at", "2015-09-27 09:11:32.365734"], ["updated_at", "2015-09-27 09:11:32.365734"]]
---
    def create
        question = Question.find(params['answer']['question_id'])
        user_answers = question.answers.where(user_id: current_user.id)
        if user_answers.size > 0
            flash[:error] = 'You can\'t answer a question more than once!'
            return redirect_to question
        end

        @answer = Answer.new(answer_params)
        if @answer.save