app/controllers/events_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 3]]
---
    def show
        @event = Event.find(params['id'])

INSERT INTO "events" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "HackGT"], ["user_id", 1], ["created_at", "2015-09-27 07:57:19.273534"], ["updated_at", "2015-09-27 07:57:19.273534"]]
---
    def create
        @event = Event.new(event_params)
        if @event.save