app/controllers/questions_controller.rb

    def new
        @event = Event.find(params['event_id'])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 5]]

    def show
        @question = Question.find(params['id'])
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]

    def create
        @question = Question.new(question_params)
        if @question.save
---
INSERT INTO "questions" ("text", "event_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "testing"], ["event_id", 5], ["user_id", 1], ["created_at", "2015-09-27 08:25:07.929145"], ["updated_at", "2015-09-27 08:25:07.929145"]]